lwfinger/rtl8723de/hal/rtl8723d/pci/pci_ops_linux.c
	while (ring->qlen) {
		tx_bufdesc = (u8 *)&ring->buf_desc[ring->idx];

		/* beacon packet will only use the first descriptor defautly, */
		/* and the OWN may not be cleared by the hardware */
		if (prio != BCN_QUEUE_INX) {
			if (!rtl8723de_check_txdesc_closed(Adapter, prio, ring))
				break;

			ring->idx = (ring->idx + 1) % ring->entries;
		} else if (prio == BCN_QUEUE_INX)
			SET_TX_BUFF_DESC_OWN_8723D(tx_bufdesc, 0);

		pxmitbuf = rtl8723de_dequeue_xmitbuf(ring);
		if (pxmitbuf) {
			dma_addr_t mapping;

			mapping = GET_TX_BUFF_DESC_ADDR_LOW_0_8723D(tx_bufdesc);
			mapping |= (dma_addr_t)GET_TX_BUFF_DESC_ADDR_HIGH_0_8723D(tx_bufdesc) << 32;

#if (LINUX_VERSION_CODE >= KERNEL_VERSION(5, 18, 0))
			dma_unmap_single(&pdvobjpriv->ppcidev->dev, mapping, pxmitbuf->len, DMA_TO_DEVICE);
#else
			pci_unmap_single(pdvobjpriv->ppcidev, mapping, pxmitbuf->len, PCI_DMA_TODEVICE);
#endif
			rtw_sctx_done(&pxmitbuf->sctx);
			rtw_free_xmitbuf(&(pxmitbuf->padapter->xmitpriv), pxmitbuf);
		} else
			RTW_INFO("%s(): qlen(%d) is not zero, but have xmitbuf in pending queue\n", __func__, ring->qlen);
	}

	if ((prio != BCN_QUEUE_INX) && check_tx_desc_resource(Adapter, prio)
	    && rtw_xmit_ac_blocked(Adapter) != _TRUE
	   )
		rtw_mi_xmit_tasklet_schedule(Adapter);
}


s32	rtl8723de_interrupt(PADAPTER Adapter)
{
	_irqL	irqL;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(Adapter);
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(Adapter);
	struct xmit_priv	*pxmitpriv = &Adapter->xmitpriv;
	int	ret = _SUCCESS;

	_enter_critical(&pdvobjpriv->irq_th_lock, &irqL);

	/* read ISR: 4/8bytes */
	if (InterruptRecognized8723DE(Adapter) == _FALSE) {
		ret = _FAIL;
		goto done;
	}

	/* <1> beacon related */
	if (pHalData->IntArray[0] & IMR_TXBCN0OK_8723D) {
		/*Modify for MI temporary,this processor cannot apply to multi-ap*/
		PADAPTER bcn_adapter = rtw_mi_get_ap_adapter(Adapter);
		if (bcn_adapter->xmitpriv.beaconDMAing) {
			bcn_adapter->xmitpriv.beaconDMAing = _FAIL;
			rtl8723de_tx_isr(Adapter, BCN_QUEUE_INX);
		}
	}

	if (pHalData->IntArray[0] & IMR_TXBCN0ERR_8723D) {
		/*Modify for MI temporary,this processor cannot apply to multi-ap*/
		PADAPTER bcn_adapter = rtw_mi_get_ap_adapter(Adapter);
		if (bcn_adapter->xmitpriv.beaconDMAing) {
			bcn_adapter->xmitpriv.beaconDMAing = _FAIL;
			rtl8723de_tx_isr(Adapter, BCN_QUEUE_INX);
		}
	}

	if (pHalData->IntArray[0] & IMR_BCNDERR0_8723D) {
		/* Release resource and re-transmit beacon to HW */
		struct tasklet_struct  *bcn_tasklet;
		/*Modify for MI temporary,this processor cannot apply to multi-ap*/
		PADAPTER bcn_adapter = rtw_mi_get_ap_adapter(Adapter);
		rtl8723de_tx_isr(Adapter, BCN_QUEUE_INX);
		bcn_adapter->mlmepriv.update_bcn = _TRUE;
		bcn_tasklet = &bcn_adapter->recvpriv.irq_prepare_beacon_tasklet;
		tasklet_hi_schedule(bcn_tasklet);
	}

	if (pHalData->IntArray[0] & IMR_BCNDMAINT0_8723D) {
		struct tasklet_struct  *bcn_tasklet;
		/*Modify for MI temporary,this processor cannot apply to multi-ap*/
		PADAPTER bcn_adapter = rtw_mi_get_ap_adapter(Adapter);

		bcn_tasklet = &bcn_adapter->recvpriv.irq_prepare_beacon_tasklet;
		tasklet_hi_schedule(bcn_tasklet);
	}

	/* <2> Rx related */
	if ((pHalData->IntArray[0] & (IMR_ROK_8723D | IMR_RDU_8723D)) || (pHalData->IntArray[1] & IMR_RXFOVW_8723D)) {
		pHalData->IntrMask[0] &= (~(IMR_ROK_8723D | IMR_RDU_8723D));
		pHalData->IntrMask[1] &= (~IMR_RXFOVW_8723D);
		rtw_write32(Adapter, REG_HIMR0_8723D, pHalData->IntrMask[0]);
		rtw_write32(Adapter, REG_HIMR1_8723D, pHalData->IntrMask[1]);
		tasklet_hi_schedule(&Adapter->recvpriv.recv_tasklet);
	}

	/* <3> Tx related */
	if (pHalData->IntArray[1] & IMR_TXFOVW_8723D) {
		/* */
		/* RTW_INFO("IMR_TXFOVW!\n"); */
	}

	/* if (pisr_content->IntArray[0] & IMR_TX_MASK) { */
	/*	tasklet_hi_schedule(&pxmitpriv->xmit_tasklet); */
	/* } */

	if (pHalData->IntArray[0] & IMR_MGNTDOK_8723D) {
		/* RTW_INFO("Manage ok interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, MGT_QUEUE_INX);
	}

	if (pHalData->IntArray[0] & IMR_HIGHDOK_8723D) {
		/* RTW_INFO("HIGH_QUEUE ok interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, HIGH_QUEUE_INX);
	}

	if (pHalData->IntArray[0] & IMR_BKDOK_8723D) {
		/* RTW_INFO("BK Tx OK interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, BK_QUEUE_INX);
	}

	if (pHalData->IntArray[0] & IMR_BEDOK_8723D) {
		/* RTW_INFO("BE TX OK interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, BE_QUEUE_INX);
	}

	if (pHalData->IntArray[0] & IMR_VIDOK_8723D) {
		/* RTW_INFO("VI TX OK interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, VI_QUEUE_INX);
	}

	if (pHalData->IntArray[0] & IMR_VODOK_8723D) {
		/* RTW_INFO("Vo TX OK interrupt!\n"); */
		rtl8723de_tx_isr(Adapter, VO_QUEUE_INX);
	}

done:

	_exit_critical(&pdvobjpriv->irq_th_lock, &irqL);

	return ret;
}

/*
  * Wait until rx data is ready
  *		return value: _SUCCESS if Rx packet is ready, _FAIL if not ready
  */

static u32
rtl8723de_wait_rxrdy(
	_adapter			*padapter,
	u8				*rx_bufdesc,
	u16				rx_queue_idx
)
{

	struct recv_priv	*precvpriv = &padapter->recvpriv;
	u8 first_seg, last_seg;
#ifdef USING_RX_TAG
	u16 rx_tag;
#else
	u16 total_len;
#endif
	u16 read_cnt = 0;
	u16 status = _SUCCESS;
	HAL_DATA_TYPE	*pHalData = GET_HAL_DATA(padapter);

	if (rx_bufdesc == NULL)
		return _FAIL;

#ifdef USING_RX_TAG
	rx_tag = (u2Byte)GET_RX_BUFFER_DESC_RX_TAG_8723D(rx_bufdesc);
#else
	total_len = (u2Byte)GET_RX_BUFFER_DESC_TOTAL_LENGTH_8723D(rx_bufdesc);
#endif
	first_seg = (u1Byte)GET_RX_BUFFER_DESC_FS_8723D(rx_bufdesc);
	last_seg = (u1Byte)GET_RX_BUFFER_DESC_LS_8723D(rx_bufdesc);

	/*buf_desc_debug("RX:%s enter: rx_buf_desc addr = %p, total_len=%d, first_seg=%d, last_seg=%d, read_cnt %d, index %d, address %p\n",\
					__FUNCTION__, (u8 *)&precvpriv->rx_ring[rx_queue_idx].desc[precvpriv->rx_ring[rx_queue_idx].idx], total_len, first_seg, last_seg, read_cnt, precvpriv->rx_ring[rx_queue_idx].idx, rx_bufdesc);*/

#if defined(USING_RX_TAG)
	while (rx_tag != pHalData->RxTag) {

		read_cnt++;

		rx_tag = (u2Byte)GET_RX_BUFFER_DESC_RX_TAG_8723D(rx_bufdesc);

		first_seg = (u1Byte)GET_RX_BUFFER_DESC_FS_8723D(rx_bufdesc);

