lwfinger/rtl8723de/hal/rtl8723d/pci/pci_ops_linux.c
		last_seg = (u1Byte)GET_RX_BUFFER_DESC_LS_8723D(rx_bufdesc);


		if (read_cnt > 100) {
			RTW_INFO("RX:%s(%d) Before sync RxTag:sw=%X,hw=%X\n", __func__, __LINE__, pHalData->RxTag, rx_tag);
			break;
		}
	}

	pHalData->RxTag = (rx_tag + 1) & 0x1FFF;	/* rx tag occpies 13 bits [28:16] */
#else
	while (total_len == 0 && first_seg == 0 && last_seg == 0) {

		read_cnt++;

		total_len = (u2Byte)GET_RX_BUFFER_DESC_TOTAL_LENGTH_8723D(rx_bufdesc);

		first_seg = (u1Byte)GET_RX_BUFFER_DESC_FS_8723D(rx_bufdesc);

		last_seg = (u1Byte)GET_RX_BUFFER_DESC_LS_8723D(rx_bufdesc);

		if (read_cnt > 20) {
			status = _FAIL;
			break;
		}
	}
#endif

	/*
	buf_desc_debug("RX:%s exit total_len=%d, rx_tag = %d, first_seg=%d, last_seg=%d, read_cnt %d\n",\
						__FUNCTION__, total_len, pHalData->RxTag, first_seg, last_seg, read_cnt);
	*/

	return status;
}

/*
  * Check the number of rxdec to be handled between
  *		"index of RX queue descriptor maintained by host (write pointer)" and
  *   "index of RX queue descriptor maintained by hardware (read pointer)"
  */
static u16 rtl8723de_check_rxdesc_remain(_adapter *padapter, struct rtw_rx_ring *prxring)
{
	struct recv_priv	*precvpriv = &padapter->recvpriv;
	u16	desc_idx_hw_wp, desc_idx_host_rp;
	u32	tmp_4bytes;

	int num_rxdesc_to_handle;

	tmp_4bytes = rtw_read32(padapter, REG_RXQ_TXBD_IDX_8723D);
	desc_idx_hw_wp = (u16)((tmp_4bytes >> 16) & 0x7ff);
	desc_idx_host_rp = (u16)(tmp_4bytes & 0x7ff);

	/* make sure driver does not handle packet if hardware pointer keeps in zero */
	/*	in initial state */
	/*buf_desc_debug("RX:%s(%d) reg_value %x\n", __FUNCTION__, __LINE__, tmp_4bytes);*/

	num_rxdesc_to_handle = desc_idx_hw_wp - desc_idx_host_rp;

	if (num_rxdesc_to_handle == 0)
		return 0;	/* No RX */

	if (num_rxdesc_to_handle < 0)	/* wrap-around case */
		num_rxdesc_to_handle += RX_BD_NUM;

	if (prxring->idx != desc_idx_host_rp) {
		prxring->idx = desc_idx_host_rp;
		RTW_INFO("RX: %s(%d) host_rp is inconsistent: sw=%X, hw=%X\n",
			 __func__, __LINE__, prxring->idx, desc_idx_host_rp);
	}

	/* buf_desc_debug("RX:%s  reg_value %x,  last_desc_idx_hw = %x, current hw idx %x, current host idx %x, remain desc to handle = %d\n",\
					__FUNCTION__, tmp_4bytes, last_idx_hw, desc_idx_hw, desc_idx_host, num_rxdesc_to_handle); */

	return (u16)num_rxdesc_to_handle;
}

static void rtl8723de_rx_mpdu(_adapter *padapter)
{
	struct recv_priv	*precvpriv = &padapter->recvpriv;
	struct dvobj_priv	*pdvobjpriv = adapter_to_dvobj(padapter);
	_queue			*pfree_recv_queue = &precvpriv->free_recv_queue;
	HAL_DATA_TYPE		*pHalData = GET_HAL_DATA(padapter);
	union recv_frame	*precvframe = NULL;
	u8				*pphy_info = NULL;
	struct rx_pkt_attrib	*pattrib = NULL;
	int	rx_queue_idx = RX_MPDU_QUEUE;
	u16	remaing_rxdesc = 0;
	struct rtw_rx_ring *prxring;

	prxring = &precvpriv->rx_ring[rx_queue_idx];

	remaing_rxdesc = rtl8723de_check_rxdesc_remain(padapter, prxring);

	/* RX NORMAL PKT */
	while (remaing_rxdesc) {
		u8	*rx_bufdesc = (u8 *)&prxring->buf_desc[prxring->idx];/* rx descriptor */
		struct sk_buff *skb = prxring->rx_buf[prxring->idx];/* rx pkt */

		if (rtl8723de_wait_rxrdy(padapter, rx_bufdesc, rx_queue_idx) != _SUCCESS)
			RTW_INFO("RX:%s(%d) packet not ready\n", __func__, __LINE__);

		{
			precvframe = rtw_alloc_recvframe(pfree_recv_queue);
			if (precvframe == NULL) {
				RTW_INFO("%s: precvframe==NULL\n", __func__);
				goto done;
			}

			_rtw_init_listhead(&precvframe->u.hdr.list);
			precvframe->u.hdr.len = 0;

#if (LINUX_VERSION_CODE >= KERNEL_VERSION(5, 18, 0))
			dma_unmap_single(&pdvobjpriv->ppcidev->dev,
					 *((dma_addr_t *)skb->cb),
					 precvpriv->rxbuffersize,
					 DMA_FROM_DEVICE);
#else
			pci_unmap_single(pdvobjpriv->ppcidev,
					 *((dma_addr_t *)skb->cb),
					 precvpriv->rxbuffersize,
					 PCI_DMA_FROMDEVICE);
#endif

			rtl8723d_query_rx_desc_status(precvframe, skb->data);
			pattrib = &precvframe->u.hdr.attrib;

#ifdef CONFIG_RX_PACKET_APPEND_FCS
			if (check_fwstate(&padapter->mlmepriv, WIFI_MONITOR_STATE) == _FALSE)
				if ((pattrib->pkt_rpt_type == NORMAL_RX) && (pHalData->ReceiveConfig & RCR_APPFCS))
					pattrib->pkt_len -= IEEE80211_FCS_LEN;
#endif

			if (rtw_os_alloc_recvframe(padapter, precvframe,
				(skb->data + RXDESC_SIZE + pattrib->drvinfo_sz + pattrib->shift_sz), skb) == _FAIL) {
				rtw_free_recvframe(precvframe, &precvpriv->free_recv_queue);
				RTW_INFO("rtl8723de_rx_mpdu:can not allocate memory for skb copy\n");
#if (LINUX_VERSION_CODE >= KERNEL_VERSION(5, 18, 0))
				*((dma_addr_t *) skb->cb) = dma_map_single(&pdvobjpriv->ppcidev->dev, skb_tail_pointer(skb), precvpriv->rxbuffersize, DMA_FROM_DEVICE);
#else
				*((dma_addr_t *) skb->cb) = pci_map_single(pdvobjpriv->ppcidev, skb_tail_pointer(skb), precvpriv->rxbuffersize, PCI_DMA_FROMDEVICE);
#endif
				goto done;
			}

			recvframe_put(precvframe, pattrib->pkt_len);

			/* Normal rx packet */
			if (pattrib->pkt_rpt_type == NORMAL_RX) {
				if (pattrib->physt)
					pphy_info = (u8 *)(skb->data) + RXDESC_SIZE;
#ifdef CONFIG_CONCURRENT_MODE
				pre_recv_entry(precvframe, pphy_info);
#endif

				if (pattrib->physt && pphy_info)
					rx_query_phy_status(precvframe, pphy_info);

				rtw_recv_entry(precvframe);
			} else {
#ifdef CONFIG_FW_C2H_PKT
				if (pattrib->pkt_rpt_type == C2H_PACKET)
					rtw_hal_c2h_pkt_pre_hdl(padapter, precvframe->u.hdr.rx_data, pattrib->pkt_len);
				else {
					RTW_INFO("%s: [WARNNING] RX type(%d) not be handled!\n",
						__func__, pattrib->pkt_rpt_type);
				}
#endif
				rtw_free_recvframe(precvframe, pfree_recv_queue);
			}

#if (LINUX_VERSION_CODE >= KERNEL_VERSION(5, 18, 0))
			*((dma_addr_t *) skb->cb) = dma_map_single(&pdvobjpriv->ppcidev->dev, skb_tail_pointer(skb), precvpriv->rxbuffersize, DMA_FROM_DEVICE);
#else
			*((dma_addr_t *) skb->cb) = pci_map_single(pdvobjpriv->ppcidev, skb_tail_pointer(skb), precvpriv->rxbuffersize, PCI_DMA_FROMDEVICE);
#endif
		}
done:

		SET_RX_BUFFER_PHYSICAL_LOW_8723D(rx_bufdesc, (*((dma_addr_t *)skb->cb) & DMA_BIT_MASK(32)));
		SET_RX_BUFFER_PHYSICAL_HIGH_8723D(rx_bufdesc, (*((dma_addr_t *)skb->cb) >> 32));
		SET_RX_BUFFER_DESC_DATA_LENGTH_8723D(rx_bufdesc, precvpriv->rxbuffersize);

